<?php

namespace App\Catalog;

class Transliteral
{
    /**
     * Из кириллицы в латиницу
     *
     * @param string $input
     * @return string
     */
    public static function transliterateen($input)
    {
        $gost = array(
            "a" => "а",     "b" => "б",     "v" => "в",     "g" => "г",     "d" => "д",
            "e" => "е",     "yo" => "ё",    "j" => "ж",     "z" => "з",     "i" => "и",
            "y" => "й",     "k" => "к",     "l" => "л",     "m" => "м",     "n" => "н",
            "o" => "о",     "p" => "п",     "r" => "р",     "s" => "с",     "t" => "т",
            "u" => "у",     "f" => "ф",     "h" => "х",     "c" => "ц",     "ch" => "ч",
            "sh" => "ш",    "sch" => "щ",   "__." => "ъ",   "yi" => "ы",    "_." => "ь",
            "ye" => "э",    "yu" => "ю",    "ya" => "я",
            "A" => "А",     "B" => "Б",     "V" => "В",     "G" => "Г",     "D" => "Д",
            "E" => "Е",     "YO" => "Ё",    "J" => "Ж",     "Z" => "З",     "I" => "И",
            "Y" => "Й",     "K" => "К",     "L" => "Л",     "M" => "М",     "N" => "Н",
            "O" => "О",     "P" => "П",     "R" => "Р",     "S" => "С",     "T" => "Т",
            "U" => "У",     "F" => "Ф",     "H" => "Х",     "C" => "Ц",     "CH" => "Ч",
            "SH" => "Ш",  "SCH" => "Щ", "YI" => "Ы", "YE" => "Э",  "YU" => "Ю",
            "YA" => "Я",  "_" => " ",
        );
        return strtr($input, $gost);
    }

    /**
     *  Из латиницы в кириллицу
     * @param string $input
     * @return string
     */
    public static function transliterate($input)
    {
        $gost = array(
            "а" => "a",     "б" => "b",     "в" => "v",     "г" => "g",     "д" => "d",
            "е" => "e",     "ё" => "yo",    "ж" => "j",     "з" => "z",     "и" => "i",
            "й" => "y",     "к" => "k",     "л" => "l",     "м" => "m",     "н" => "n",
            "о" => "o",     "п" => "p",     "р" => "r",     "с" => "s",     "т" => "t",
            "у" => "u",     "ф" => "f",     "х" => "h",     "ц" => "c",     "ч" => "ch",
            "ш" => "sh",    "щ" => "sch",   "ъ" => "__.",   "ы" => "yi",    "ь" => "_.",
            "э" => "ye",    "ю" => "yu",    "я" => "ya",
            "А" => "A",     "Б" => "B",     "В" => "V",     "Г" => "G",     "Д" => "D",
            "Е" => "E",     "Ё" => "YO",    "Ж" => "J",     "З" => "Z",     "И" => "I",
            "Й" => "Y",     "К" => "K",     "Л" => "L",     "М" => "M",     "Н" => "N",
            "О" => "O",     "П" => "P",     "Р" => "R",     "С" => "S",     "Т" => "T",
            "У" => "U",     "Ф" => "F",     "Х" => "H",     "Ц" => "C",     "Ч" => "CH",
            "Ш" => "SH",    "Щ" => "SCH",   "Ы" => "YI",    "Э" => "YE",    "Ю" => "YU",
            "Я" => "YA",    " " => "_",
        );
        return strtr($input, $gost);
    }
}
